cases/passiveFoxASMFoam/pitzDaily/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application scalarTransportFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

// ************************************************************************* //
/*
functions
(
	outletPatchMassFlowAverage
	{
		type patchMassFlowAverage;
		functionObjectLibs ("libsimpleFunctionObjects.so" );
		verbose true;
		outputControl timeStep;
		outputInterval 1;
		patches ( outlet );
		fields ( C );
	}

	outletPatchAverage
	{
		type patchAverage;
		functionObjectLibs ("libsimpleFunctionObjects.so" );
		verbose true;
		outputControl timeStep;
		outputInterval 1;
		patches ( outlet );
		fields ( C );
	}
);*/
